// Оператори
// Операнд - дані, над якими виконуються дії.
// Операція - дії, які виконуютсья над операндами.
// Оператори поділяються на (в залежності від кількості операндів):
// Унарні - оператори, яким необхідний тільки один операнд
// +, -, ++, --
// Бінарні - оператори, яким необхідні два оператори (зліва і зправа від оператора)
// +, -, /, *, %, =, **
// Тернарний оператор - оператор, якому необхідно три операнди. (?:)

// Оператори поділяютсья на (В залежності від виконуваної операції):
// ++ - інкремент (збільшення змінної на 1)
// Ділиться:
// 1. Префіксний інкремент (++а) - спочатку збільшує змінну, а потім виводить.
// 2. Постфіксний інкремент (а++) - спочатку виводить, а пізніше збільшує.
// -- - декремент (зменшення змінної на 1)
// 1. Префіксний інкремент (--а) - спочатку зменшує змінну, а потім виводить.
// 2. Постфіксний інкремент (а--) - спочатку виводить, а пізніше зменшує.
// Приклад:
// let a = 1
// console.log(a) // 1
// console.log(++a) // 2
// console.log(a--) // 2
// console.log(a) // 1

// Завдання 1:

// let a = 3
// console.log(a) // 3
// console.log(a++) // 3
// console.log(++a) // 5
// console.log(a) // 5
// console.log(a++) // 5
// console.log(a++) // 6
// console.log(--a) // 6
// console.log(a) // 6


// 1. Арифметичні: (+, -, *, /, %, ++, --, =)
// % - ділення по модулю

// let num = 123
// console.log(num/100) // 1.23
// console.log(num % 100) // 23

// console.log (123/10) //12.3
// console.log (123 % 10) // 3
// Math.trunc() - відкидає залишок.
// Завдання 2:

// 589
// 9
// 8
// 5

// let num = 589
// console.log(num % 10)
// console.log(Math.trunc(num / 10) % 10)
// console.log(Math.trunc(num / 100) % 10)


// Логічні оператори:
// >, <, <=, >=, ==, ===, !=, !==
// &&, ||, !

// Завдання для ділення по модулю: